In [2]:
# pandas 호출
import pandas as pd

### DataFrame
- pandas의 대표적인 자료구조
- 2차원 데이터 구조로 행과 열로 구성

In [8]:
# 데이터 프레임 생성하기
pd.DataFrame([[1,2,3],
             [4,5,6],
             [7,8,9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [10]:
# 변수에 저장
df = pd.DataFrame([[1,2,3],
             [4,5,6],
             [7,8,9]])

In [11]:
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [12]:
# Column명 지정
pd.DataFrame([[1, 2, 3],
              [4, 5, 6],
              [7, 8, 9]], columns=['가', '나', '다'])

   가  나  다
0  1  2  3
1  4  5  6
2  7  8  9

In [3]:
# student.csv 파일 읽기
df = pd.read_csv('data/student.csv')

In [4]:
df

       gre   gpa  rank sex  age nationality admission
0    380.0  3.61     3   f   19       Korea       불합격
1    660.0  3.67     3   f   18       Korea       NaN
2    800.0  4.00     1   m   19       Korea        합격
3      NaN  3.19     4   m   19       Korea        합격
4    520.0  2.93     4   f   19       Korea       불합격
..     ...   ...   ...  ..  ...         ...       ...
395  620.0  4.00     2   f   20       Korea       불합격
396  560.0  3.04     3   m   18       Korea       불합격
397  460.0  2.63     2   m   19       Korea       불합격
398  700.0   NaN     2   m   19       Korea       불합격
399  600.0  3.89     3   m   19       Korea       불합격

[400 rows x 7 columns]

In [15]:
# 앞부분 다섯개 확인
df.head()

     gre   gpa  rank sex  age nationality admission
0  380.0  3.61     3   f   19       Korea       불합격
1  660.0  3.67     3   f   18       Korea       NaN
2  800.0  4.00     1   m   19       Korea        합격
3    NaN  3.19     4   m   19       Korea        합격
4  520.0  2.93     4   f   19       Korea       불합격

In [16]:
# 뒷부분 다섯개 확인
df.tail()

       gre   gpa  rank sex  age nationality admission
395  620.0  4.00     2   f   20       Korea       불합격
396  560.0  3.04     3   m   18       Korea       불합격
397  460.0  2.63     2   m   19       Korea       불합격
398  700.0   NaN     2   m   19       Korea       불합격
399  600.0  3.89     3   m   19       Korea       불합격

In [18]:
# (n) n개만큼 샘플 확인
df.head(10)

     gre   gpa  rank sex  age nationality admission
0  380.0  3.61     3   f   19       Korea       불합격
1  660.0  3.67     3   f   18       Korea       NaN
2  800.0  4.00     1   m   19       Korea        합격
3    NaN  3.19     4   m   19       Korea        합격
4  520.0  2.93     4   f   19       Korea       불합격
5  760.0  3.00     2   f   19       Korea        합격
6  560.0  2.98     1   m   19       Korea        합격
7  400.0  3.08     2   f   19       Korea       불합격
8  540.0  3.39     3   m   19       Korea        합격
9  700.0  3.92     2   m   19       Korea       불합격

In [20]:
# 칼럼 정보 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   gre          398 non-null    float64
 1   gpa          398 non-null    float64
 2   rank         400 non-null    int64
 3   sex          400 non-null    object
 4   age          400 non-null    int64
 5   nationality  400 non-null    object
 6   admission    398 non-null    object
dtypes: float64(2), int64(2), object(3)
memory usage: 22.0+ KB

In [23]:
# colum 별 값의 분포 확인
df.value_counts('nationality')

nationality
Korea      357
India       17
China        8
Japan        7
Vietnam      7
Mongol       4
Name: count, dtype: int64

In [24]:
# 요약 통계 확인
df.describe()

              gre         gpa       rank         age
count  398.000000  398.000000  400.00000  400.000000
mean   587.889447    3.389749    2.48500   19.025000
std    115.599708    0.381314    0.94446    0.809948
min    220.000000    2.260000    1.00000   17.000000
25%    520.000000    3.130000    2.00000   19.000000
50%    580.000000    3.395000    2.00000   19.000000
75%    660.000000    3.670000    3.00000   19.000000
max    800.000000    4.000000    4.00000   22.000000

In [25]:
# 문자열(object)에 대한 요약 통계 확인
df.describe(include='object')

        sex nationality admission
count   400         400       398
unique    2           6         2
top       m       Korea       불합격
freq    216         357       270

In [33]:
# age에 대해서만 평균 구하기(2가지 방법)
df['age'].mean()
df.age.mean()

19.025

### 조건별 통계 계산
- loc(location)
    - 칼럼의 label이나 인덱스 번호로 인덱싱하는 기능 제공
    - 특정 조건식에 따라 필터링

In [36]:
# 남자만 보기

       gre   gpa  rank sex  age nationality admission
2    800.0  4.00     1   m   19       Korea        합격
3      NaN  3.19     4   m   19       Korea        합격
6    560.0  2.98     1   m   19       Korea        합격
8    540.0  3.39     3   m   19       Korea        합격
9    700.0  3.92     2   m   19       Korea       불합격
..     ...   ...   ...  ..  ...         ...       ...
394  460.0  3.99     3   m   22       Korea        합격
396  560.0  3.04     3   m   18       Korea       불합격
397  460.0  2.63     2   m   19       Korea       불합격
398  700.0   NaN     2   m   19       Korea       불합격
399  600.0  3.89     3   m   19       Korea       불합격

[216 rows x 7 columns]

In [38]:
# 남자인 데이터의 나이만 보기
df.loc[df['sex']=='m', 'age']

2      19
3      19
6      19
8      19
9      19
       ..
394    22
396    18
397    19
398    19
399    19
Name: age, Length: 216, dtype: int64

In [41]:
# 조건식 변수화 가능
condition = (df['sex']=='m')
df.loc[condition, 'age']

2      19
3      19
6      19
8      19
9      19
       ..
394    22
396    18
397    19
398    19
399    19
Name: age, Length: 216, dtype: int64

In [43]:
# 남자인 데이터의 나이의 평균값은b
df.loc[condition, 'age'].mean()

19.041666666666668